<a href="https://colab.research.google.com/github/unbrae/DataScience/blob/main/eda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [98]:
dataSet = pd.read_csv('https://raw.githubusercontent.com/unbrae/DataScience/dataSets/working_hours_per_week.csv')
df = pd.DataFrame(dataSet)

df.rename(columns={'country':'Country'})

df.head()

                country  1969  1970  1971  1972  ...  2012  2013  2014  2015  2016
0                 Aruba   NaN   NaN   NaN   NaN  ...   NaN   NaN   NaN   NaN   NaN
1               Albania   NaN   NaN   NaN   NaN  ...  40.9  38.0  38.8  39.6  40.3
2  United Arab Emirates   NaN   NaN   NaN   NaN  ...   NaN   NaN   NaN   NaN   NaN
3             Argentina   NaN   NaN   NaN   NaN  ...  39.0  38.4   NaN  42.9  37.7
4               Armenia   NaN   NaN   NaN   NaN  ...  38.3  40.4  38.3  37.9   NaN

[5 rows x 49 columns]

In [120]:
c = df.select_dtypes(include='number')
col = []
for i in c.columns:
  col.append(i)
#print(col)

col = pd.DataFrame(pd.Series(col))
col = col.rename(columns={0:'Year'})
col.head()

   Year
0  1969
1  1970
2  1971
3  1972
4  1973

In [124]:
df = df[['country','2015']]
df = pd.melt(df,id_vars=['country'],var_name='year',value_name='hours')

df

                  country  year  hours
0                   Aruba  2015    NaN
1                 Albania  2015   39.6
2    United Arab Emirates  2015    NaN
3               Argentina  2015   42.9
4                 Armenia  2015   37.9
..                    ...   ...    ...
132               Vietnam  2015   41.3
133                 Samoa  2015    NaN
134                 Yemen  2015    NaN
135          South Africa  2015   43.3
136              Zimbabwe  2015    NaN

[137 rows x 3 columns]

In [139]:
# Verificando valores nulos
display(df.isnull().sum())

# Retirando os valores nulos da coluna Hours
df = df[~ np.isnan(df['hours'])]

display(df.isnull().sum())

Verificando valores nulos

country    0
year       0
hours      0
dtype: int64

Verificando valores nulos

country    0
year       0
hours      0
dtype: int64